# Python homework 1

''' 1. Запросите у пользователя имя и месячную зарплату в долларах и выведите их годовую зарплату в тысячах долларов.
Например: «Мишель», «12345» → «Годовая зарплата Мишель составляет 148 тыс. долларов» '''

name = input('Введіть ваше імʼя: ')                                     # інпут ім'я
mons_salary = int(input('Введіть вашу місячну зарплатню в $: '))        # інпут зп

print(f'Річна зарплатня {name} складає {mons_salary*12} тис. доларів')  # вивід з розрахунком



'''2. Запросите целое число и выведите «True», если это четное число в диапазоне от 100 до 999, в противном случае - «False».'''

number = int(input('Введіть ціле число: ')) #інпут та перетворення в число

if 100 <= number <= 999:                    # перевірка діапазону
    if number %2 == 0:                      # перевірка на парність через остачу від ділення
        print('True')
    else:
        print('False')
else:
    print(f'Число {number} за межами діапазону 100--999')



'''3. В качестве входящих данных возьмем целое число; Предположим, что это число от 101 до 999, а его последняя цифра не равна нулю.
# Выведите обратное число. Например: 256 → 652.'''

n = input('Введіть ціле 3-х значне число: ') # input для числа

if int(n[-1:]) != 0:                         #перетворення останнього елементу рядка в число та перевірка на нерівність  0
    print(int(n[::-1]))                      #вивід навпаки та перетворення в число так як просять вивести число.



'''4. Запросите два целых числа и выведите:
        a. Их сумму
        b. Их разность
        c. Произведение
        d. Результат деления первого на второе
        e. Остаток от деления первого на второе
        f. «True», если первое число больше или равно второму, иначе «False».'''

n_1 = int(input('Ведіть цілe число 1: '))                                  # інпут 1
n_2 = int(input('Ведіть цілe число 2: '))                                  # інпут 2

print(f' Сума: {n_1 + n_2} \n \
Різниця: {n_1 - n_2} \n \
Добуток: {n_1*n_2} \n \
Ділення: {n_1 / n_2} \n \
Залишок від ділення: {n_1 % n_2} \n \
True якщо n1 більше n2 інакше False: {"True" if n_1 >= n_2 else "False"}') #загальний прінт та перенос строки для кращого читання коду
