
#Python homework 2

''' 1. В качестве входящих данных запросите целое число. Если оно делится на 3, выведите «foo»; если оно делится на 5,
выведите «bar»; если оно делится на оба, выведите «ham» (а не «foo» или «bar»).'''

n = int(input('Введіть ціле число:'))     # інпут та перетворення в ціле число

if n % 3 == 0 and n % 5 == 0:             # перевірка ділення на 3 та 5 
    print('ham')
elif n % 5 == 0:                          # перевірка ділення на 5
    print('bar')
elif n % 3 == 0:                          # перевірка ділення на 3
    print('foo')



'''2. В качестве входящих данных запросите два числа и выведите какое из них меньше и какое большее.''' 

n1, n2 = map(int, input('Введіть ДВА цілих числа через ПРОБІЛ: ').split())                # зчитуємо 2 числа через пробіл
print(f' min: {min(n1, n2)} \n max: {max(n1, n2)}')                                       # вивід та перевірка мін та макс, не грався варіантом з умовами



'''3. В качестве входящих данных запросите три числа и выведите наименьшее, среднее и наибольшее. Предположим, все они разные.'''

list_input = list(map(int, input('Введіть ТРИ цілих числа через ПРОБІЛ: ').split()))                      #зчитуємо 3 числа за раз через пробіл

print(f' min: {min(list_input)} \n max: {max(list_input)} \n mean: {sum(list_input)/len(list_input)}')    # виводимо все в одному прінті мін, макс, середне. 



'''4. Прочтите это объяснение list slicing .
         Дякую, прочитав, доречі гарний ресурс.'''



'''5. Сыграйте в игру Fizz-Buzz: выведите все числа от 1 до 100; если число делится на 3, вместо числа выведите «fizz».
Если оно делится на 5, вместо числа выведите “buzz”. Если оно делится на оба, выведите «fizz buzz» вместо числа.'''

for _ in range(1, 100):
    if _ % 3 == 0 and _ % 5 == 0:             # перевірка ділення на 3 та 5 
        print('«fizz buzz»')
    elif _ % 5 == 0:                          # перевірка ділення на 5
        print('“buzz”')
    elif _ % 3 == 0:                          # перевірка ділення на 3
        print('«fizz»')
    else:
        print(_)                              # вивід просто числа з циклу



'''6. Сыграйте в игру 7-boom: выведите все числа от 1 до 100; если число делится на 7 или содержит цифру 7, выведите “BOOM” вместо числа.'''

for _ in range(1, 100):
    if _ % 7 == 0:                           # перевірка ділення на 7
        print('“BOOM”')
    elif str(_).find('7') != -1:             # перевірка наявності 7
        print('“BOOM”')
    else:
        print(_)                             # вивід просто числа з циклу


